emacs/.emacs.d/config.org
#+TITLE: Emacs configuration

* Bootstrap
** Identity
#+BEGIN_SRC emacs-lisp :tangle yes
(setq user-full-name ""
      user-mail-address "")
#+END_SRC
** Eager basic config
*** Generic
#+BEGIN_SRC emacs-lisp :tangle yes
  (setq ad-redefinition-action 'accept)

  (defalias 'yes-or-no-p 'y-or-n-p)

  (setq inhibit-startup-screen t)
  (setq initial-scratch-message ";;; Lisp Interaction Mode\n")
  (setq initial-major-mode 'lisp-interaction-mode)

  (setq coding-system-for-read 'utf-8)
  (setq coding-system-for-write 'utf-8)
  (prefer-coding-system 'utf-8)

  (setq-default fill-column 80)
  (setq-default indent-tabs-mode nil)
  (setq visible-bell nil
        ring-bell-function
        (lambda ()
          (let ((orig-fg (face-foreground 'mode-line)))
            (set-face-foreground 'mode-line "#F2804F")
            (run-with-idle-timer
             0.1 nil
             (lambda (fg) (set-face-foreground 'mode-line fg))
             orig-fg))))

  (setq ns-use-srgb-colorspace nil)

  (scroll-bar-mode -1)
  (tool-bar-mode -1)
  (line-number-mode -1)
  (column-number-mode -1)
  (size-indication-mode -1)

  (unless (frame-parameter nil 'fullscreen)
    (if
        (eval-when-compile
          (eq system-type 'darwin))
        (toggle-frame-fullscreen)
      (toggle-frame-maximized)))

  (setq-default cursor-type 'bar)
  (blink-cursor-mode -1)
#+END_SRC
*** Backups
#+BEGIN_SRC emacs-lisp :tangle yes
  (setq delete-old-versions -1)
  (setq version-control t)
  (setq vc-make-backup-files t)
  (setq backup-directory-alist '(("." . "~/.emacs.d/backups")))
  (setq vc-follow-symlinks t)
  (setq auto-save-file-name-transforms '((".*" "~/.emacs.d/auto-save-list/" t)))
#+END_SRC
*** Don't use ~custom~
#+BEGIN_SRC emacs-lisp :tangle yes
(setq-default custom-file "/dev/null")
#+END_SRC

** Add .emacs.d/lisp to ~load-path~
#+BEGIN_SRC emacs-lisp :tangle yes
(add-to-list 'load-path (eval-when-compile (expand-file-name "~/.emacs.d/lisp")))
#+END_SRC
** Ensure ~use-package~
#+BEGIN_SRC emacs-lisp :tangle yes
  (require 'package)
  (package-initialize)
  (setq package-archives
        '(("gnu" . "https://elpa.gnu.org/packages/")
          ("org" . "https://orgmode.org/elpa/")
          ("melpa-stable" . "https://stable.melpa.org/packages/")
          ;; ("marmalade" . "http://marmalade-repo.org/packages/")
          ("melpa" . "https://melpa.org/packages/")))

  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))

  (eval-when-compile
    (require 'use-package))

  (use-package diminish
    :ensure t)

  (use-package use-package-chords
    :ensure t
    :config
    (progn
      (key-chord-mode +1)
      (setq key-chord-two-keys-delay 0.05)))

  (use-package use-package-prefixed-bind)
#+END_SRC

** Set up ~exec-path~ correctly
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package exec-path-from-shell
    :ensure t
    :hook (after-init . exec-path-from-shell-initialize))
#+END_SRC

* Daemon
#+BEGIN_SRC emacs-lisp :tangle yes
  (add-hook 'after-init-hook (lambda () (server-start)))
#+END_SRC
* Dependencies
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package f :ensure t :defer t)
  (use-package s :ensure t :defer t)
  (use-package dash :ensure t :defer t)
  (use-package powerline :ensure t :defer t)
  (use-package let-alist :ensure t :defer t)
  (use-package all-the-icons :ensure t :defer t)
  (use-package hydra :ensure t :demand t)
  (use-package helper-functions :demand t)
#+END_SRC
* Which Key?
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package which-key
    :ensure t
    :diminish which-key-mode
    :hook (after-init . which-key-mode)
    :config
    (progn
      (setq which-key-sort-order 'which-key-key-order-alpha
            which-key-side-window-max-width 0.33
            which-key-idle-delay 0.5)

      (defun rename-mnemonic-key-prefix (key-string name)
        (which-key-add-key-based-replacements
          (concat +keybinding/mnemonic-prefix+ " " key-string) name))

      (rename-mnemonic-key-prefix "!" "Terminal")
      (rename-mnemonic-key-prefix "b" "Buffers")
      (rename-mnemonic-key-prefix "c" "Compilation")
      (rename-mnemonic-key-prefix "e" "Errors")
      (rename-mnemonic-key-prefix "f" "Files")
      (rename-mnemonic-key-prefix "g" "VCS")
      (rename-mnemonic-key-prefix "p" "Projects")
      (rename-mnemonic-key-prefix "r" "Ring/Register")
      (rename-mnemonic-key-prefix "s" "Search/Replace")
      (rename-mnemonic-key-prefix "sr" "Replace")
      (rename-mnemonic-key-prefix "t" "Tags")
      (rename-mnemonic-key-prefix "w" "Windows")))
#+END_SRC
* Interface framework
Approach to evolve interface framework
 + Current: Helm, FTW.
 + Past: Use Ivy/Counsel everywhere with fuzzy matching for selected functions. Fallback to
   well-configured Ido+smex.
 + Past: Use IDO as much as possible and switch to Ivy when IDO doesn't cut it.

** COMMENT IDO
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package smex
    :disabled
    :ensure t
    :defer t)
  (use-package ido
    :disabled
    :ensure t
    :bind (:map ido-completion-map
                ("<tab>" . ido-exit-minibuffer)
                ("<return>" . ido-exit-minibuffer))
    :config
    (progn
      (setq ido-enable-flex-matching t)
      (setq ido-use-virtual-buffers t)
      (setq ido-enable-regexp t)

      (ido-mode +1)
      (ido-vertical-mode +1)))
  (use-package ido-completing-read+
    :disabled
    :ensure t
    :after ido
    :config
    (ido-ubiquitous-mode +1))
  (use-package ido-vertical-mode
    :disabled
    :ensure t
    :after ido
    :config
    (ido-vertical-mode +1))
  (use-package flx
    :defer t
    :ensure t)
  (use-package flx-ido
    :disabled
    :ensure t
    :after (ido flx)
    :config (flx-ido-mode +1))
#+END_SRC

** COMMENT Ivy
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package counsel
    :disabled
    :ensure t)
  (use-package ivy
    :disabled
    :ensure t
    :diminish ivy-mode
    :bind (("M-x" . counsel-M-x)
           ("C-c M-x" . execute-extended-command)
           ("C-x C-f" . counsel-find-file))
    :config
    (progn
      (setq ivy-use-virtual-buffers t)
      (setq enable-recursive-minibuffers t)
      (setq ivy-count-format "[%d / %d] ")
      (ivy-mode +1)
      (setq ivy-re-builders-alist
            '((counsel-M-x . ivy--regex-fuzzy)
              (counsel-find-file . ivy--regex-fuzzy)
              (t . ivy--regex-plus)))))
#+END_SRC

** Helm
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package helm
    :ensure t
    :demand
    :diminish helm-mode
    :bind (("C-c h" . helm-command-prefix)
           ("M-x" . helm-M-x)
           ("C-x C-f" . helm-find-files)
           ("C-x b" . helm-mini)
           ("M-s o" . helm-occur)
           :map helm-map
           ("C-i" . helm-execute-persistent-action) ; make TAB work in terminal
           ([tab] . helm-execute-persistent-action)
           ("C-z" . helm-select-action))
    :prefixed-bind (("bb" . helm-mini)
                    ("ry" . helm-show-kill-ring)
                    ("ff" . helm-find-files)
                    ("tt" . helm-semantic-or-imenu))
    :config
    (progn
      (require 'helm-config)
      (setq helm-move-to-line-cycle-in-source t
            helm-ff-search-library-in-sexp t
            helm-scroll-amount 8
            helm-ff-file-name-history-use-recentf t
            ;; helm-echo-input-in-header-line t

            helm-buffers-fuzzy-matching t
            helm-recentf-fuzzy-match t
            helm-locate-fuzzy-match t
            helm-M-x-fuzzy-match t
            helm-semantic-fuzzy-match t
            helm-imenu-fuzzy-match t
            helm-apropos-fuzzy-match t
            helm-lisp-fuzzy-completion t
            helm-session-fuzzy-match t
            helm-etags-fuzzy-match t
            helm-mode-fuzzy-match t
            helm-completion-in-region-fuzzy-match t
            helm-candidate-number-limit 100

            helm-autoresize-min-height 24
            helm-autoresize-max-height 24

            helm-quick-update t
            helm-ff-skip-boring-files t)

      (helm-mode +1)
      (helm-autoresize-mode +1)))

  (use-package helm-projectile
    :ensure t
    :after (helm projectile)
    :hook (after-init . helm-projectile-on)
    :prefixed-bind (("pp" . helm-projectile)))

  (use-package helm-descbinds
    :ensure t
    :hook (after-init . helm-descbinds-mode))

  (use-package helm-ag
    :ensure t
    :commands (helm-ag))
#+END_SRC
* General packages
** Builtins
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package autorevert
    :diminish auto-revert-mode
    :hook (after-init . global-auto-revert-mode)
    :config
    (setq auto-revert-verbose nil))

  (use-package abbrev
    :diminish abbrev-mode)

  (use-package ibuffer
    :bind (("C-x C-b" . ibuffer)))

  (use-package hippie-exp
    :bind (("M-/" . hippie-expand)))
#+END_SRC

** Annoying arrows
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package annoying-arrows-mode
    :ensure t
    :defer 5
    :diminish annoying-arrows-mode
    :commands global-annoying-arrows-mode
    :config
    (global-annoying-arrows-mode +1))
#+END_SRC

** Beacon
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package beacon
    :ensure t
    :bind (("C-\\" . beacon-blink)))
#+END_SRC

