emacs/.emacs.d/config.el

(use-package crux
  :after (helper-functions)
  :commands (crux-eval-and-replace)
  :ensure t
  :bind (("C-S-j" . join-next-line)
         ("C-S-k" . join-line)
         ("C-S-y" . crux-duplicate-current-line-or-region)
         ("C-a" . crux-move-beginning-of-line)
         ("C-S-d" . crux-kill-whole-line)
         ("C-c =" . crux-indent-defun))
  :prefixed-bind (("!!" . crux-visit-term-buffer)))

(use-package paren
  :hook (after-init . show-paren-mode))

(use-package rainbow-delimiters
  :ensure t
  :hook (prog-mode . rainbow-delimiters-mode))

(use-package whitespace
  :diminish global-whitespace-mode
  :hook (prog-mode . whitespace-mode)
  :hook (text-mode . whitespace-mode)
  :hook (before-save . delete-trailing-whitespace)
  :init
  (progn
    (setq whitespace-style '(face lines-tail))
    (setq whitespace-line-column 80)
    (setq-default require-final-newline t)))

(use-package highlight-indent-guides
  :ensure t
  :hook (prog-mode . highlight-indent-guides-mode)
  :init
  (progn
    (setq highlight-indent-guides-auto-odd-face-perc 2)
    (setq highlight-indent-guides-auto-even-face-perc 4)))

(use-package expand-region
  :ensure t
  :bind (("C-=" . er/expand-region)))

(use-package hungry-delete
  :ensure t
  :diminish hungry-delete-mode
  :hook (after-init . global-hungry-delete-mode))

(use-package ediff
  :config
  (setq ediff-window-setup-function 'ediff-setup-windows-plain))

(use-package disable-mouse
  :ensure t
  :diminish disable-mouse-mode
  :diminish disable-mouse-global-mode
  :hook (after-init . global-disable-mouse-mode))

(use-package writegood-mode
  :disabled
  :ensure t
  :hook (text-mode . writegood-mode))

(use-package artbollocks-mode
  :ensure t
  :hook (text-mode . artbollocks-mode))

(use-package register
  :prefixed-bind (("rr" . copy-to-register)
                  ("ri" . insert-register)))

(use-package yasnippet
  :ensure t
  :diminish yas-minor-mode
  :hook (after-init . yas-global-mode)
  :prefixed-bind ("is" . yas-expand))

(use-package undo-tree
  :ensure t
  :diminish undo-tree-mode
  :bind (:map undo-tree-visualizer-mode-map
              ("<RET>" . undo-tree-visualizer-quit)))

(use-package isearch
  :bind
  (("C-s" . isearch-forward-regexp)
   ("C-r" . isearch-backward-regexp)
   ("C-M-s" . isearch-forward)
   ("C-M-r" . isearch-backward)))

(use-package ag
  :ensure t
  :defer 5)

(use-package swiper-helm
  :ensure t
  :after helm
  :chords (("??" . swiper-helm))
  :prefixed-bind ("ss" . swiper-helm))

(use-package anzu
  :ensure t
  :diminish anzu-mode
  :hook (after-init . global-anzu-mode)
  :bind (([remap query-replace] . anzu-query-replace)
         ([remap query-replace-regexp] . anzu-query-replace-regexp))
  :prefixed-bind (("srr" . anzu-query-replace-regexp)
                  ("sr." . anzu-query-replace-at-cursor-thing)))

(use-package wgrep
  :ensure t
  :defer 5)

(use-package wgrep-ag
  :ensure t
  :defer 5)

(use-package iedit
  :ensure t
  :bind (("C-'" . iedit-mode)))

(use-package company
  :ensure t
  :hook (after-init . global-company-mode)
  :defines (company-dabbrev-downcase)
  :config
  (progn
    (setq company-show-numbers t)
    (setq company-dabbrev-downcase nil)))

(use-package company-quickhelp
  :ensure t
  :hook (after-init . company-quickhelp-mode))

(use-package windmove
  :prefixed-bind
  (("bd" . kill-this-buffer)
   ("bn" . next-buffer)
   ("bp" . previous-buffer)

   ("wd" . delete-window)
   ("wD" . delete-other-window)
   ("wh" . split-window-horizontally)
   ("wv" . split-window-vertically)

   ("C-i" . switch-to-previous-buffer)

   ("ww" . windows-hydra/body))
  :init
  (defhydra windows-hydra ()
    "
   ^Windows^				^Window^		^Zoom^
   --------------------------------------------------------------------------
   _<left>_ _h_: windmove-left		_w_: enlarge	_-_: zoom out
   _<down>_ _j_: windmove-down		_s_: shrink	_+_ _=_: zoom in
   _<up>_ _k_: windmove-up		_a_: widen	_0_: reset
   _<right>_ _l_: windmove-right	_d_: tighten	_q_: quit"
    ("<left>" windmove-left)
    ("<right>" windmove-right)
    ("<up>" windmove-up)
    ("<down>" windmove-down)
    ("h" windmove-left)
    ("j" windmove-down)
    ("k" windmove-up)
    ("l" windmove-right)
    ("+" text-scale-increase)
    ("=" text-scale-increase)
    ("-" text-scale-decrease)
    ("w" enlarge-window)
    ("a" enlarge-window-horizontally)
    ("s" shrink-window)
    ("d" shrink-window-horizontally)
    ("0" (text-scale-increase 0))
    ("q" nil)))

(use-package window-numbering
  :ensure t
  :hook (after-init . window-numbering-mode))

(use-package eldoc
  :ensure t
  :diminish eldoc-mode
  :hook (after-init . global-eldoc-mode))

(use-package flycheck
  :ensure t
  :diminish flycheck-mode
  :hook (after-init . global-flycheck-mode)
  :init
  (setq flycheck-keymap-prefix (kbd (concat +keybinding/mnemonic-prefix+ " e"))))

(use-package flycheck-pos-tip
  :ensure t
  :hook (after-init . flycheck-pos-tip-mode))

(use-package flyspell
  :ensure t
  :after (exec-path-from-shell)
  :diminish (flyspell-mode . " ")
  :hook (text-mode . flyspell-mode)
  :hook (prog-mode . flyspell-prog-mode)
  :init
  (progn
    (setq-default ispell-program-name "/usr/local/bin/aspell")
    (setq-default ispell-list-commaqnd "--list")))

(use-package flyspell-correct-helm
  :ensure t
  :after (flyspell helm)
  :bind (:map flyspell-mode-map
              ("C-c C-\\" . flyspell-correct-previous-word-generic)))

(use-package elec-pair
  :hook (text-mode . electric-pair-local-mode))
