emacs/.emacs.d/config.el

(use-package smartparens-config
  :ensure smartparens
  :demand t
  :diminish (smartparens-mode . " ")
  :hook (prog-mode . smartparens-mode)
  :hook (minibuffer-setup . smartparens-mode)
  :bind (:map smartparens-mode-map
              ;; Strict mode toggle
              ("C-c C-s" . smartparens-strict-mode)
              ;; Navigation
              ("C-M-a" . sp-beginning-of-sexp)
              ("C-M-e" . sp-end-of-sexp)
              ("C-M-f" . sp-forward-sexp)
              ("C-M-b" . sp-backward-sexp)

              ;; Traversal
              ("C-<down>" . sp-down-sexp)
              ("C-<up>"   . sp-up-sexp)
              ("M-<down>" . sp-backward-down-sexp)
              ("M-<up>"   . sp-backward-up-sexp)
              ("C-M-n"    . sp-next-sexp)
              ("C-M-p"    . sp-previous-sexp)
              ("C-S-f"    . sp-forward-symbol)
              ("C-S-b"    . sp-backward-symbol)

              ;; AST re-arrange.
              ("C-)" . sp-forward-slurp-sexp)
              ;; ("C-)" . 'sp-slurp-hybrid-sexp)
              ("C-}" . sp-forward-barf-sexp)
              ("C-(" . sp-backward-slurp-sexp)
              ("C-{" . sp-backward-barf-sexp)

              ;; Killing
              ("C-M-k"    . sp-kill-sexp)
              ("C-k"      . sp-kill-hybrid-sexp)
              ("M-k"      . sp-backward-kill-sexp)
              ("C-M-<up>" . sp-raise-sexp)

              ;; Unknown
              ("C-M-t" . sp-transpose-sexp)
              ;; ("C-M-w" . sp-copy-sexp)
              ;; ("C-M-d" . delete-sexp)
              ;; ("M-<backspace>" . backward-kill-word)
              ;; ("C-<backspace>" . sp-backward-kill-word)
              ;; ([remap sp-backward-kill-word] . backward-kill-word)
              ;; ("M-[" . sp-backward-unwrap-sexp)
              ;; ("M-]" . sp-unwrap-sexp)
              ;; ("C-x C-t" . sp-transpose-hybrid-sexp)

              ;; Wrap
              ("C-c C-w ("  . (lambda () (interactive) (sp-wrap-with-pair "(")))
              ("C-c C-w ["  . (lambda () (interactive) (sp-wrap-with-pair "[")))
              ("C-c C-w {"  . (lambda () (interactive) (sp-wrap-with-pair "{")))
              ("C-c C-w '"  . (lambda () (interactive) (sp-wrap-with-pair "'")))
              ("C-c C-w \"" . (lambda () (interactive) (sp-wrap-with-pair "\"")))
              ("C-c C-w `"  . (lambda () (interactive) (sp-wrap-with-pair "`"))))
  :config
  (progn
    (cl-delete 'minibuffer-inactive-mode sp-ignore-modes-list)
    (sp-local-pair 'minibuffer-inactive-mode "'" nil :actions nil)))

(use-package electric
  :hook (after-init . electric-indent-mode))

(use-package paredit
  :ensure t
  :disabled t)

(use-package avy
  :ensure t
  :chords (("jj" . avy-goto-word-1)))

(use-package compile
  :prefixed-bind (("cc" . compile)
                  ("cr" . recompile)))

(use-package savehist
  :hook (after-init . savehist-mode)
  :config
  (progn
    (setq savehist-additional-variables '(kill-ring search-ring regexp-search-ring))
    (setq savehist-file "~/.emacs.d/tmp/history")))

(use-package recentf
  :hook (after-init . recentf-mode)
  :config
  (progn
    (setq recentf-max-menu-items 25)

    ;; Save recent files every few minutes.
    (run-at-time nil (* 5 60) 'recentf-save-list)

    ;; Silent the saved recent files message
    (silence-function 'recentf-save-list)))

(use-package magit
  :ensure t
  :prefixed-bind (("gs" . magit-status)))

(use-package diff-hl
  :ensure t
  :commands (diff-hl-mode diff-hl-flydiff-mode diff-hl-margin-mode)
  :init
  (progn
    (enable-minor-mode-globally diff-hl-mode)
    (enable-minor-mode-globally diff-hl-flydiff-mode))
  :config
  (add-hook 'magit-post-refresh-hook 'diff-hl-magit-post-refresh)
  (defhydra diff-hl-hydra (:foreign-keys warn)
    "diff-hl-hydra"
    ("n" diff-hl-next-hunk "Next Hunk")
    ("p" diff-hl-previous-hunk "Previous Hunk")
    ("k" diff-hl-revert-hunk "Kill Hunk")
    ("q" nil "Quit")))

(eval-when-compile
  (unless (>= emacs-major-version 26)
    (defalias 'smerge-keep-upper 'smerge-keep-mine)
    (defalias 'smerge-keep-lower 'smerge-keep-other)
    (defalias 'smerge-diff-base-upper 'smerge-diff-base-mine)
    (defalias 'smerge-diff-upper-lower 'smerge-diff-mine-other)
    (defalias 'smerge-diff-base-lower 'smerge-diff-base-other)))

(use-package smerge-mode
  :demand
  :prefixed-bind (:map smerge-mode-map
                       ("m" . hydra-smerge/body))
  :init
  (defhydra hydra-smerge
    (:foreign-keys warn)
    "
^Move^	^Keep^	^Aux^	^Diff^
------------------------------------------------------
_n_ext	_b_ase	_R_efine	_<_: base-upper	_q_uit
_p_rev	_u_pper	_E_diff	_=_: upper-lower	_RET_: current
^ ^	_l_ower	_C_ombine	_>_: base-lower
^ ^	_a_ll	_r_esolve"
    ("RET" smerge-keep-current)
    ("C" smerge-combine-with-next)
    ("E" smerge-ediff)
    ("R" smerge-refine)
    ("a" smerge-keep-all)
    ("b" smerge-keep-base)
    ("u" smerge-keep-upper)
    ("n" smerge-next)
    ("l" smerge-keep-lower)
    ("p" smerge-prev)
    ("r" smerge-resolve)
    ("<" smerge-diff-base-upper)
    ("=" smerge-diff-upper-lower)
    (">" smerge-diff-base-lower)
    ("q" nil :color red)))

(use-package projectile
  :ensure t
  :diminish projectile-mode
  :hook (after-init . projectile-mode)
  :init
  (progn
    (setq projectile-enable-caching t)
    (setq projectile-keymap-prefix (kbd (concat +keybinding/mnemonic-prefix+ " p"))))
  :config
  (progn
    (setq projectile-completion-system 'helm)
    (setq projectile-mode-line '(:eval (format " P[%s]" (projectile-project-name))))))

(use-package irony
  :disabled
  :ensure t
  :commands irony-mode
  :init
  (progn
    (add-hook 'c++-mode-hook 'irony-mode)
    (add-hook 'c-mode-hook 'irony-mode)
    (add-hook 'objc-mode-hook 'irony-mode))
  :config
  (add-hook 'irony-mode-hook 'irony-cdb-autosetup-compile-options))

(use-package company-irony
  :disabled
  :ensure t
  :commands company-irony
  :after (company irony)
  :init
  (add-to-list 'company-backends 'company-irony)
  (add-hook
   'c++-mode-hook
   #'(lambda ()
       (setq-local company-backends (delete 'company-clang company-backends)))))

(use-package company-irony-c-headers
  :disabled
  :ensure t
  :commands company-irony-c-headers
  :after (company irony)
  :init
  (add-to-list 'company-backends 'company-irony-c-headers))

;; Company-clang doesn't work well with the work setup.

(use-package flycheck-irony
  :disabled
  :ensure t
  :commands flycheck-irony-setup
  :after (flycheck irony)
  :init
  (add-hook 'c-mode-common-hook #'flycheck-irony-setup))

(use-package irony-eldoc
  :disabled
  :ensure t
  :commands irony-eldoc
  :after irony
  :init
  (add-hook 'irony-mode-hook #'irony-eldoc))

(use-package google-c-style
  :ensure t
  :hook (c-mode-common . google-set-c-style))
