emacs/.emacs.d/config.org
*** Navigation using RTags
RTags is a great navigation framework for C++. Unfortunately, it doesn't handle gargantuan codebases from cloud filesystems like work.
Still, good to have in config.
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package rtags
    :disabled
    :config
    (progn
      ;; Can't do it since this is not compatible with work. Also, irony-mode is pretty good.
      (setq rtags-completions-enabled nil)

      (setq rtags-autostart-diagnostics t)
      (rtags-enable-standard-keybindings)))

  ;; Maybe someday.

  (use-package company-rtags
    :disabled
    :after (company rtags)
    :config
    (add-to-list 'company-backends 'company-rtags))
#+END_SRC

*** TODO Explore cmake-ide

*** TODO Set up debugger
** Lisp
*** Lisp common settings
**** Define ~lisp-family-mode-hook~
#+BEGIN_SRC emacs-lisp :tangle yes
  (defvar lisp-family-mode-hook nil
    "Hook for lisp family major modes.")

  (add-hook 'emacs-lisp-mode-hook #'(lambda () (run-hooks 'lisp-family-mode-hook)))
  (add-hook 'lisp-mode-hook #'(lambda () (run-hooks 'lisp-family-mode-hook)))
#+END_SRC
**** Strict Smartparens
#+BEGIN_SRC emacs-lisp :tangle yes
  (add-hook 'lisp-family-mode-hook #'smartparens-strict-mode)
#+END_SRC
**** Redshank
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package redshank
    :ensure t
    :after paredit
    :diminish redshank-mode
    :hook (lisp-family-mode . redshank-mode))
#+END_SRC
**** Macrostep
Macrostep is for incremental macro expansion.
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package macrostep
    :ensure t
    :bind (:map emacs-lisp-mode-map
                ("C-c m" . macrostep-mode)
                :map lisp-mode-map
                ("C-c m" . macrostep-mode)))
#+END_SRC
*** Emacs Lisp
**** Basic setup
#+BEGIN_SRC emacs-lisp :tangle yes
  ;; Helper functions.
  (use-package elisp-mode
    :demand
    :bind (:map emacs-lisp-mode-map
                ("C-c C-z" . elisp-visit-ielm)
                ("C-c C-c" . eval-defun)
                ("C-c C-b" . eval-buffer)
                ("C-c C-r" . eval-region))
    :hook (emacs-lisp-mode . emacs-lisp-mode-setup)
    :init
    (progn
      (defun elisp-visit-ielm ()
        "Switch to default `ielm' buffer.
         Start `ielm' if it's not already running."
        (interactive)
        (crux-start-or-switch-to 'ielm "*ielm*"))

      (defun elisp-recompile-elc-on-save ()
        "Recompile when saving an elisp file."
        (add-hook
         'after-save-hook
         (lambda ()
           (when (file-exists-p (byte-compile-dest-file buffer-file-name))
             (emacs-lisp-byte-compile)))
         nil
         :local))

      (defun emacs-lisp-mode-setup ()
        "Setup for emacs-lisp mode."
        (elisp-recompile-elc-on-save)
        (setq mode-name "ELisp"))))

  (use-package elisp-slime-nav
    :ensure t
    :after (elisp-mode)
    :diminish elisp-slime-nav-mode
    :hook (emacs-lisp-mode . turn-on-elisp-slime-nav-mode)
    :hook (ielm-mode . turn-on-elisp-slime-nav-mode))
#+END_SRC
**** Litable
Use litable to evaluate code in the margin. Helpful for quick iteration
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package litable
    :ensure t
    :bind (:map emacs-lisp-mode-map
                ("C-c l" . litable-mode)
                :map lisp-interaction-mode-map
                ("C-c l" . litable-mode)
                :map litable-mode-map
                ("C-c p" . litable-accept-as-pure))

    :config
    (setq litable-list-file "~/.emacs.d/tmp/litable-lists.el"))
#+END_SRC
**** Pretty print eval-expression
~eval-expr~ is a replacement for ~eval-expression~ with prettified output.
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package eval-expr
    :ensure t
    ;; Use `pp-eval-expression'. Retain the config for minibuffer setup example.
    :disabled
    :bind (("M-:" . eval-expr))
    :config
    (progn
      (setq eval-expr-print-function 'pp
            eval-expr-print-level 20
            eval-expr-print-length 100)

      (defun eval-expr-minibuffer-setup ()
        (set-syntax-table emacs-lisp-mode-syntax-table)
        (setq-local
         eldoc-documentation-function #'elisp-eldoc-documentation-function)
        (eldoc-mode +1))))
#+END_SRC

Use ~pp-eval-expression~ instead of ~eval-expr~.
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package pp
    :bind (("M-:" . pp-eval-expression)))
#+END_SRC
**** Lisp interaction mode hook
#+BEGIN_SRC emacs-lisp :tangle yes
  (add-hook
   'lisp-interaction-mode-hook
   #'(lambda () (run-hooks 'emacs-lisp-mode-hook)))
#+END_SRC
*** common-lisp
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package slime
    :ensure t
    :hook (common-lisp-mode . slime-mode)
    :functions (slime-toggle-fancy-trace slime-inspect-definition)
    :bind (:map lisp-mode-map
                ("C-c '" . slime)

                ("C-c cc" . slime-compile-file)
                ("C-c cC" . slime-compile-and-load-file)
                ("C-c cl" . slime-load-file)
                ("C-c cf" . slime-compile-defun)
                ("C-c cr" . slime-compile-region)
                ("C-c cn" . slime-remove-notes)

                ("C-c eb" . slime-eval-buffer)
                ("C-c ef" . slime-eval-defun)
                ("C-c eF" . slime-undefine-function)
                ("C-c ee" . slime-eval-last-expression)
                ("C-c er" . slime-eval-region)

                ("C-c gb" . slime-pop-find-definition-stack)
                ("C-c gn" . slime-next-note)
                ("C-c gN" . slime-previous-note)

                ("C-c ha" . slime-apropos)
                ("C-c hA" . slime-apropos-all)
                ("C-c hd" . slime-disassemble-symbol)
                ("C-c hh" . slime-describe-symbol)
                ("C-c hH" . slime-hyperspec-lookup)
                ("C-c hi" . slime-inspect-definition)
                ("C-c hp" . slime-apropos-package)
                ("C-c ht" . slime-toggle-trace-fdefinition)
                ("C-c hT" . slime-untrace-all)
                ("C-c h<" . slime-who-calls)
                ("C-c h>" . slime-calls-who)
                ("C-c hr" . slime-who-references)
                ("C-c hm" . slime-who-macroexpands)
                ("C-c hs" . slime-who-specializes)

                ("C-c Ma" . slime-macroexpand-all)
                ("C-c Mo" . slime-macroexpand-1)

                ("C-c se" . slime-eval-last-expression-in-repl)
                ("C-c si" . slime)
                ("C-c sq" . slime-quit-lisp)

                ("C-c tf" . slime-toggle-fancy-trace))
    :config
    (progn
      (require 'slime-fancy-trace)
      (require 'slime-fancy-inspector)
      (setq inferior-lisp-program "sbcl")
      (setq slime-contribs '(slime-fancy
                             slime-indentation
                             slime-sbcl-exts
                             slime-scratch
                             slime-company))

      ;; enable fuzzy matching in code buffer and SLIME REPL
      (setq slime-complete-symbol*-fancy t)

      (add-hook 'slime-repl-mode-hook #'turn-off-smartparens-mode)

      (slime-setup '(slime-repl))

      ))

  (use-package slime-company
    :ensure t
    :after (company)
    :commands (company-slime)
    :init
    (add-to-list 'company-backends 'company-slime)
    :config
    (setq slime-company-completion 'fuzzy))
#+END_SRC
*** TODO Clojure
** Go
*** Mode Setup
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package go-mode
    :ensure t
    :mode "\\.go\\'"
    :config
    (progn
      (defun go-mode-setup ()
        (add-hook 'before-save-hook #'gofmt-before-save)
        (setq-local tab-width 2)
        (setq gofmt-command "goimports")
        (go-guru-hl-identifier-mode +1))
      (add-hook 'go-mode-hook #'go-mode-setup)))
#+END_SRC
*** Completion
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package company-go
    :ensure t
    :after (company go-mode)
    :commands company-go
    :init
    (add-to-list 'company-backends 'company-go)
    :config
    (setq company-go-show-annotation t))
#+END_SRC
*** Syntax Checker
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package flycheck-gometalinter
    :ensure t
    :after (flycheck go-mode)
    :hook (go-mode . flycheck-gometalinter-setup))
#+END_SRC
*** Documentation
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package go-eldoc
    :ensure t
    :hook (go-mode . go-eldoc-setup))
#+END_SRC
*** ~go-rename~
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package go-rename
    :if (executable-find "gorename")
    :bind (:map go-mode-map
                ("C-c r" . go-rename)))
#+END_SRC
*** TODO Compilation and Debugger
** Haskell
