emacs/.emacs.d/config.org
*** Major mode
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package haskell-mode
    :ensure t
    :mode "\\.hs\\'"
    :bind (:map haskell-mode-map
                ("C-c d" . haskell-debug)
                ("C-c i" . haskell-interactive-switch)
                ("C-c t" . haskell-process-do-type)
                ("C-c h" . haskell-process-do-info)
                ("C-c fi" . haskell-add-import)
                ("C-c ff" . haskell-mode-stylish-buffer))
    :config
    (add-hook 'haskell-mode-hook #'turn-on-haskell-indent))
#+END_SRC
*** Helper packages
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package hindent
    :ensure t
    :if (executable-find "hindent")
    :hook (haskell-mode . hindent-mode)
    :config
    ;; reformat the buffer using hindent on save
    (setq hindent-reformat-buffer-on-save t))
#+END_SRC
*** Intero
Intero works well with stack projects. But without stack, we still need other options.
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package intero
    :after (haskell-mode company flycheck)
    :ensure t
    :hook (haskell-mode . intero-mode)
    :config
    (add-to-list 'flycheck-ghc-search-path (expand-file-name "~/.xmonad/lib")))
#+END_SRC
** TODO HTML emmet
** COMMENT JS
#+BEGIN_SRC emacs-lisp :tangle yes
  ;; Copied from emacs web config.
  (use-package js2-mode
    :ensure t
    :mode
    ("\\.js$" . js2-mode)
    ("\\.json$" . js2-jsx-mode)
    :config
    (progn
      (custom-set-variables '(js2-strict-inconsistent-return-warning nil))
      (custom-set-variables '(js2-strict-missing-semi-warning nil))

      (setq js-indent-level 2)
      (setq js2-indent-level 2)
      (setq js2-basic-offset 2)))

  ;; tern :- IDE like features for javascript and completion
  ;; http://ternjs.net/doc/manual.html#emacs
  (use-package tern
    :ensure t
    :hook (js2-mode . tern-mode))

  ;; company backend for tern
  ;; http://ternjs.net/doc/manual.html#emacs
  (use-package company-tern
    :ensure t
    :after (tern js2-mode company)
    :commands company-tern
    :init
    (add-to-list 'company-backends 'company-tern))

  ;; Run a JavaScript interpreter in an inferior process window
  ;; https://github.com/redguardtoo/js-comint
  (use-package js-comint
    :ensure t
    :config
    (setq inferior-js-program-command "node"))

  ;; js2-refactor :- refactoring options for emacs
  ;; https://github.com/magnars/js2-refactor.el
  (use-package js2-refactor
    :ensure t
    :hook (js2-mode . js2-refactor-mode)
    :config
    (js2r-add-keybindings-with-prefix "C-c j r"))
#+END_SRC
** Java
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package cc-mode
    :init
    (add-hook
     'java-mode-hook
     (lambda () (setq fill-column 100
                      whitespace-line-column 100))))
#+END_SRC
** LaTeX
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package tex
    :ensure auctex
    :pin gnu
    :config
    (progn
      (setq TeX-parse-self t)  ;; Enable parse on load.
      (setq TeX-auto-save t)  ;; Enable parse on save.

      (setq TeX-PDF-mode t)))

  (use-package company-auctex
    :ensure t
    :after (company tex)
    :hook (after-init . company-auctex-init))
#+END_SRC
** Markdown
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package markdown-mode
    :ensure t
    :commands (markdown-mode gfm-mode)
    :mode (("README\\.md\\'" . gfm-mode)
           ("\\.md\\'" . markdown-mode)
           ("\\.markdown\\'" . markdown-mode)))
#+END_SRC
** Protocol buffers
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package protobuf-mode
    :ensure t
    :mode "\\.proto\\'"
    :init
    (add-hook
     'protobuf-mode-hook
     #'(lambda ()
         (setq
          imenu-generic-expression
          '((nil "^[[:space:]]*\\(message\\|service\\|enum\\)[[:space:]]+\\([[:alnum:]]+\\)" 2))))))
#+END_SRC
** Python
*** Python mode setup
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package python
    :ensure t
    :mode ("\\.py\\'" . python-mode)
    :init
    (setq python-shell-interpreter "ipython"
          python-shell-interpreter-args "--simple-prompt -i"))
#+END_SRC

*** Anaconda setup
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package anaconda-mode
    :ensure t
    :diminish anaconda-mode
    :diminish anaconda-eldoc-mode
    :hook (python-mode . anaconda-mode))

  (use-package company-anaconda
    :ensure t
    :after (anaconda-mode company)
    :commands company-anaconda
    :init
    (add-to-list 'company-backends 'company-anaconda))
#+END_SRC

*** Virtualenv
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package virtualenvwrapper
    :disabled
    :config
    (progn
      (setq eshell-prompt-function
         (lambda () (concat venv-current-name " $ ")))
      (venv-initialize-interactive-shells)
      (venv-initialize-eshell)))

  (use-package pyenv-mode
    :ensure t
    :hook (python-mode . pyenv-mode)
    :after virtualenvwrapper)
#+END_SRC

*** Formatter
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package py-yapf
    :commands py-yapf
    :ensure t)
#+END_SRC

*** Testing
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package pytest
    :commands pytest
    :ensure t)
#+END_SRC
*** TODO Setup ein
** Shell
*** Setup for Bash and Zsh files
#+BEGIN_SRC emacs-lisp :tangle yes
  (defconst +zsh-filename-patterns+
    '("\\.zsh\\'"
      "zlogin\\'"
      "zlogout\\'"
      "zpreztorc\\'"
      "zprofile\\'"
      "zshenv\\'"
      "zshrc\\'")
    "Filename patterns for Zsh script files.")

  (use-package sh-script
    :commands (sh-set-shell)
    :init
    (progn
      (dolist (pattern +zsh-filename-patterns+)
        (add-to-list 'auto-mode-alist (cons pattern 'sh-mode)))
      (add-hook
       'sh-mode-hook
       #'(lambda ()
         (when
             (and
              buffer-file-name
              (cl-mapcar #'(lambda (pat) (string-match-p pat buffer-file-name)) +zsh-filename-patterns+))
           (sh-set-shell "zsh"))))))
#+END_SRC

*** Code completion
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package company-shell
    :ensure t
    :commands company-shell
    :after company
    :init
    (add-hook
     'sh-mode-hook
     #'(lambda ()
       (add-to-list
        (make-local-variable 'company-backends)
        'company-shell))))
#+END_SRC

*** Insert shebang
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package insert-shebang
    :ensure t
    :config
    (progn
      ;; Don't insert shebang proactively.
      (remove-hook 'find-file-hook 'insert-shebang)))
#+END_SRC

** COMMENT ESS (Statistics/R)
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package ess
    :disabled
    :bind (:map inferior-ess-mode-map
                ("C-<up>". comint-previous-matching-input-from-input)
                ("C-<down>" . comint-next-matching-input-from-input)
                ("C-x t" . comint-dynamic-complete-filename)))
#+END_SRC
** Org mode setup
*** Org
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package org
    :ensure t
    :pin gnu
    :bind (:map org-mode-map
                ("C-<up>" . org-move-subtree-up)
                ("C-<down>" . org-move-subtree-down))
    :config
    (progn
      (setq org-refile-targets '((org-agenda-files . (:maxlevel . 6))))

      (setq org-outline-path-complete-in-steps nil)
      (setq org-refile-use-outline-path t)))
#+END_SRC
*** Org agenda
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package org-agenda
    :after (org)
    :functions (org-agenda)
    :bind (([f2] . load-org-gtd-agenda)
           ("C-c a" . load-org-gtd-agenda))
    :init
    (defun load-org-gtd-agenda ()
      "Load custom agenda directly."
      (interactive)
      (org-agenda nil "c"))
    :config
    (progn
      (setq org-agenda-files '("~/organizer/main.org"))
      (setq org-agenda-custom-commands '(("c" "GTD Agenda View"
                                          ((agenda "")
                                           (alltodo "")))))))
#+END_SRC
*** Org bullets
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package org-bullets
    :after (org)
    :ensure t
    :diminish org-bullets-mode
    :hook (org-mode . org-bullets-mode))
#+END_SRC
*** Org indent
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package org-indent
    :diminish org-indent-mode
    :hook (org-mode . org-indent-mode))
#+END_SRC
*** Org capture
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package org-capture
    :after (org)
    :bind (([f6] . org-capture)
           ("C-c c" . org-capture))
    :init
    (setq org-capture-templates
          '(("a" "Action Item" entry (file+headline "~/organizer/main.org" "Action Items")
             "* TODO [#B] %?\n  %i")
            ("c" "Calendar" entry (file+headline "~/organizer/main.org" "Calendar")
             "* %?\n %^T\n %i")
            ("r" "Reference" entry (file "~/organizer/reference.org")
             "* %?\n  %i\n%^{prompt|Description}\n\n:PROPERTIES:\n:RecordDate:\t%T\n:END:"
             :prepend t
             :empty-lines 1))))

#+END_SRC
*** Org source editing
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package org-src
    :diminish (org-src-mode . " ")
    :config
    (add-hook
     'org-src-mode-hook
     (lambda ()
       (setq-local flycheck-disabled-checkers
                   (cons 'emacs-lisp-checkdoc flycheck-disabled-checkers)))))
#+END_SRC
