emacs/.emacs.d/config.el

(use-package haskell-mode
  :ensure t
  :mode "\\.hs\\'"
  :bind (:map haskell-mode-map
              ("C-c d" . haskell-debug)
              ("C-c i" . haskell-interactive-switch)
              ("C-c t" . haskell-process-do-type)
              ("C-c h" . haskell-process-do-info)
              ("C-c fi" . haskell-add-import)
              ("C-c ff" . haskell-mode-stylish-buffer))
  :config
  (add-hook 'haskell-mode-hook #'turn-on-haskell-indent))

(use-package hindent
  :ensure t
  :if (executable-find "hindent")
  :hook (haskell-mode . hindent-mode)
  :config
  ;; reformat the buffer using hindent on save
  (setq hindent-reformat-buffer-on-save t))

(use-package intero
  :after (haskell-mode company flycheck)
  :ensure t
  :hook (haskell-mode . intero-mode)
  :config
  (add-to-list 'flycheck-ghc-search-path (expand-file-name "~/.xmonad/lib")))

(use-package cc-mode
  :init
  (add-hook
   'java-mode-hook
   (lambda () (setq fill-column 100
                    whitespace-line-column 100))))

(use-package tex
  :ensure auctex
  :pin gnu
  :config
  (progn
    (setq TeX-parse-self t)  ;; Enable parse on load.
    (setq TeX-auto-save t)  ;; Enable parse on save.

    (setq TeX-PDF-mode t)))

(use-package company-auctex
  :ensure t
  :after (company tex)
  :hook (after-init . company-auctex-init))

(use-package markdown-mode
  :ensure t
  :commands (markdown-mode gfm-mode)
  :mode (("README\\.md\\'" . gfm-mode)
         ("\\.md\\'" . markdown-mode)
         ("\\.markdown\\'" . markdown-mode)))

(use-package protobuf-mode
  :ensure t
  :mode "\\.proto\\'"
  :init
  (add-hook
   'protobuf-mode-hook
   #'(lambda ()
       (setq
        imenu-generic-expression
        '((nil "^[[:space:]]*\\(message\\|service\\|enum\\)[[:space:]]+\\([[:alnum:]]+\\)" 2))))))

(use-package python
  :ensure t
  :mode ("\\.py\\'" . python-mode)
  :init
  (setq python-shell-interpreter "ipython"
        python-shell-interpreter-args "--simple-prompt -i"))

(use-package anaconda-mode
  :ensure t
  :diminish anaconda-mode
  :diminish anaconda-eldoc-mode
  :hook (python-mode . anaconda-mode))

(use-package company-anaconda
  :ensure t
  :after (anaconda-mode company)
  :commands company-anaconda
  :init
  (add-to-list 'company-backends 'company-anaconda))

(use-package virtualenvwrapper
  :disabled
  :config
  (progn
    (setq eshell-prompt-function
       (lambda () (concat venv-current-name " $ ")))
    (venv-initialize-interactive-shells)
    (venv-initialize-eshell)))

(use-package pyenv-mode
  :ensure t
  :hook (python-mode . pyenv-mode)
  :after virtualenvwrapper)

(use-package py-yapf
  :commands py-yapf
  :ensure t)

(use-package pytest
  :commands pytest
  :ensure t)

(defconst +zsh-filename-patterns+
  '("\\.zsh\\'"
    "zlogin\\'"
    "zlogout\\'"
    "zpreztorc\\'"
    "zprofile\\'"
    "zshenv\\'"
    "zshrc\\'")
  "Filename patterns for Zsh script files.")

(use-package sh-script
  :commands (sh-set-shell)
  :init
  (progn
    (dolist (pattern +zsh-filename-patterns+)
      (add-to-list 'auto-mode-alist (cons pattern 'sh-mode)))
    (add-hook
     'sh-mode-hook
     #'(lambda ()
       (when
           (and
            buffer-file-name
            (cl-mapcar #'(lambda (pat) (string-match-p pat buffer-file-name)) +zsh-filename-patterns+))
         (sh-set-shell "zsh"))))))

(use-package company-shell
  :ensure t
  :commands company-shell
  :after company
  :init
  (add-hook
   'sh-mode-hook
   #'(lambda ()
     (add-to-list
      (make-local-variable 'company-backends)
      'company-shell))))

(use-package insert-shebang
  :ensure t
  :config
  (progn
    ;; Don't insert shebang proactively.
    (remove-hook 'find-file-hook 'insert-shebang)))

(use-package org
  :ensure t
  :pin gnu
  :bind (:map org-mode-map
              ("C-<up>" . org-move-subtree-up)
              ("C-<down>" . org-move-subtree-down))
  :config
  (progn
    (setq org-refile-targets '((org-agenda-files . (:maxlevel . 6))))

    (setq org-outline-path-complete-in-steps nil)
    (setq org-refile-use-outline-path t)))

(use-package org-agenda
  :after (org)
  :functions (org-agenda)
  :bind (([f2] . load-org-gtd-agenda)
         ("C-c a" . load-org-gtd-agenda))
  :init
  (defun load-org-gtd-agenda ()
    "Load custom agenda directly."
    (interactive)
    (org-agenda nil "c"))
  :config
  (progn
    (setq org-agenda-files '("~/organizer/main.org"))
    (setq org-agenda-custom-commands '(("c" "GTD Agenda View"
                                        ((agenda "")
                                         (alltodo "")))))))

(use-package org-bullets
  :after (org)
  :ensure t
  :diminish org-bullets-mode
  :hook (org-mode . org-bullets-mode))

(use-package org-indent
  :diminish org-indent-mode
  :hook (org-mode . org-indent-mode))

(use-package org-capture
  :after (org)
  :bind (([f6] . org-capture)
         ("C-c c" . org-capture))
  :init
  (setq org-capture-templates
        '(("a" "Action Item" entry (file+headline "~/organizer/main.org" "Action Items")
           "* TODO [#B] %?\n  %i")
          ("c" "Calendar" entry (file+headline "~/organizer/main.org" "Calendar")
           "* %?\n %^T\n %i")
          ("r" "Reference" entry (file "~/organizer/reference.org")
           "* %?\n  %i\n%^{prompt|Description}\n\n:PROPERTIES:\n:RecordDate:\t%T\n:END:"
           :prepend t
           :empty-lines 1))))

(use-package org-src
  :diminish (org-src-mode . " ")
  :config
  (add-hook
   'org-src-mode-hook
   (lambda ()
     (setq-local flycheck-disabled-checkers
                 (cons 'emacs-lisp-checkdoc flycheck-disabled-checkers)))))
