emacs/.emacs.d/config.org
*** Org capture system-wide shortcut helper
Copied from [[http://cestlaz.github.io/posts/using-emacs-24-capture-2][C'est la Z blog]].
#+BEGIN_SRC emacs-lisp :tangle yes
  (defadvice org-capture-finalize
      (after delete-capture-frame activate)
    "Advise capture-finalize to close the frame."
    (if (equal "capture" (frame-parameter nil 'name))
      (delete-frame)))

  (defadvice org-capture-destroy
      (after delete-capture-frame activate)
    "Advise capture-destroy to close the frame."
    (if (equal "capture" (frame-parameter nil 'name))
      (delete-frame)))

  (use-package noflet
    :commands noflet
    :ensure t)

  (defun make-capture-frame ()
    "Create a new frame and run `org-capture'."
    (interactive)
    (make-frame '((name . "capture")))
    (select-frame-by-name "capture")
    (delete-other-windows)
    (noflet ((switch-to-buffer-other-window (buf) (switch-to-buffer buf)))
      (org-capture)))
#+END_SRC
* Code Semantics
** Semantic
*** Stickyfunc
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package stickyfunc-enhance
    :ensure t
    :defer t)
#+END_SRC

*** Srefactor
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package srefactor
    :ensure t
    :defer t)
#+END_SRC

*** Semantic setup
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package semantic
    :hook (prog-mode . semantic-mode)
    :init
    (progn
      (setq semantic-default-submodes
            '( ;; Perform semantic actions during idle time
              global-semantic-idle-scheduler-mode
              ;; Use a database of parsed tags
              global-semanticdb-minor-mode
              ;; Decorate buffers with additional semantic information
              ;; global-semantic-decoration-mode
              ;; Highlight the name of the function you're currently in
              global-semantic-highlight-func-mode
              ;; show the name of the function at the top in a sticky
              global-semantic-stickyfunc-mode
              ;; Generate a summary of the current tag when idle
              ;; global-semantic-idle-summary-mode

              ;; Show a breadcrumb of location during idle time
              global-semantic-idle-breadcrumbs-mode
              ;; Switch to recently changed tags with `semantic-mrub-switch-tags',
              ;; or `C-x B'
              global-semantic-mru-bookmark-mode))))
#+END_SRC

** TODO Tags
** Which function mode
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package which-func
    :disabled
    :config
    (progn
      (which-function-mode +1)
      (setq which-func-unknown "")))
#+END_SRC
* Encryption
** GPG and EPA config
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package epa
    :config
    (progn
      ;; EPA basic config
      (setq epa-file-cache-passphrase-for-symmetric-encryption nil)

      ;; Pinentry config
      (setq epa-pinentry-mode 'loopback)))
#+END_SRC
** Auth sources
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package auth-source
    :config
    (setq auth-sources '((:source "~/.emacs.d/.authinfo.gpg"))))
#+END_SRC
** Expire cache
#+BEGIN_SRC emacs-lisp :tangle yes
  (add-hook
   'after-init-hook
   (lambda ()
     (run-at-time
      "1 min"
      nil
      (lambda () (with-temp-buffer
                   (shell-command "killall gpg-agent" (current-buffer)))))))
#+END_SRC
* ERC
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package erc-config)
    ;;:hook (after-init . erc-autoconnect-servers))
#+END_SRC
* elfeed
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package elfeed
    :ensure t
    :functions (elfeed-toggle-star)
    :commands (elfeed elfeed-db-load elfeed-search-update--force)
    :bind (([f5] . elfeed-load-db-and-open)
           :map elfeed-search-mode-map
           ("m" . elfeed-toggle-star)
           ("M" . elfeed-toggle-star)
           ("h" . elfeed-hydra/body)
           ("q" . elfeed-save-db-and-bury))
    :init
    ;; Functions to support syncing .elfeed between machines
    ;; makes sure elfeed reads index from disk before launching
    (defun elfeed-load-db-and-open ()
      "Wrapper to load the elfeed db from disk before opening"
      (interactive)
      (elfeed-db-load)
      (elfeed)
      (elfeed-search-update--force))
    :config
    (progn
      ;;write to disk when quiting
      (defun elfeed-save-db-and-bury ()
        "Wrapper to save the elfeed db to disk before burying buffer"
        (interactive)
        (elfeed-db-save)
        (quit-window))

      (defun elfeed--toggle-tag-in-filter (filter tag)
        "Toggles the tag in elfeed search filter."
        (if (s-contains? tag filter)
            (s-replace "  " " " (s-replace tag "" filter))
          (concat filter " " tag)))

      (defun elfeed-filter-toggle-tag (tag)
        "Toggle the tag in active filter."
        (elfeed-search-set-filter (elfeed--toggle-tag-in-filter elfeed-search-filter tag)))

      (setq elfeed-db-directory "~/.elfeed")

      (defhydra elfeed-hydra nil
        "
  ^Tags^			^Duration^		^Actions^
  ^^^^^^^---------------------------------------------------------------
  _e_macs			_6_: Last 6 months	_U_: Mark as Unread
  _c_omics			_T_: Today		_R_: Mark as Read
  _m_achine-learning 	_w_: Last week		_b_: Open in browser
  _s_cience
  _u_nread
  "
        ("e" (elfeed-filter-toggle-tag "+emacs"))
        ("u" (elfeed-filter-toggle-tag "+unread"))
        ("c" (elfeed-filter-toggle-tag "+comics"))
        ("m" (elfeed-filter-toggle-tag "+ml"))
        ("s" (elfeed-filter-toggle-tag "+science"))
        ("6" (elfeed-filter-toggle-tag "@6-months-ago"))
        ("T" (elfeed-filter-toggle-tag "@1-day-ago"))
        ("w" (elfeed-filter-toggle-tag "@1-week-ago"))
        ("U" (elfeed-search-tag-all-unread))
        ("R" (elfeed-search-untag-all-unread))
        ("b" elfeed-search-browse-url)
        ("n" next-line)
        ("<down>" next-line)
        ("p" previous-line)
        ("<up>" previous-line)
        ("q" (message "Exit from Elfeed Hydra.") :exit t))

      (defalias 'elfeed-toggle-star
        (elfeed-expose #'elfeed-search-toggle-all 'star))))

  (use-package elfeed-org
    :ensure t
    :commands (elfeed-org)
    :init
    (progn
      (setq rmh-elfeed-org-files '("~/.elfeed/feed.org"))
      (add-hook 'after-init-hook #'elfeed-org)))

  (use-package elfeed-goodies
    :ensure t
    :hook (after-init . elfeed-goodies/setup))
#+END_SRC
* TODO Gnus
* Theming
** Color theme and font
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package material-theme
    :ensure t
    :config
    (progn
      (load-theme 'material t)
      (set-frame-font "Iosevka-18")
      (set-face-attribute 'default nil
                          :background "#212121"
                          :foreground "#eeffff")
      (set-face-attribute 'font-lock-constant-face nil
                          :foreground "#C792EA")
      (set-face-attribute 'font-lock-keyword-face nil
                          :foreground "#2BA3FF")
      (set-face-attribute 'font-lock-preprocessor-face nil
                          :inherit 'bold
                          :foreground "#2BA3FF"
                          :weight 'normal)
      (set-face-attribute 'font-lock-string-face nil
                          :foreground "#C3E88D")
      (set-face-attribute 'font-lock-type-face nil
                          :foreground "#FFCB6B")
      (set-face-attribute 'font-lock-variable-name-face nil
                          :foreground "#FF5370")
      (set-face-attribute 'mode-line nil
                          :box '(:style released-button))))
#+END_SRC

** Modeline
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package spaceline
    :disabled
    :config
    (require 'spaceline-config)
    (spaceline-emacs-theme))

  (use-package smart-mode-line
    :disabled
    :config
    (setq sml/no-confirm-load-theme t)
    (sml/setup))

  (use-package helium-modeline
    ;; :requires (powerline let-alist projectile flycheck window-numbering)
    :hook (window-setup . powerline-helium-theme))
#+END_SRC

** Theme enhancements.
Enhance the loaded theme.
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package theme-enhancement
    :hook (after-init . (lambda () (theme-enhancement/apply :bold :italics :org))))
#+END_SRC
** Line numbers
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package display-line-numbers
    :hook (after-init . global-display-line-numbers-mode)
    :init
    (setq-default display-line-numbers-widen t
                  display-line-numbers-grow-only t
                  display-line-numbers-width 5)
    (set-face-attribute 'line-number-current-line nil :inherit 'fringe))
#+END_SRC
* Load machine configuration
#+BEGIN_SRC emacs-lisp :tangle yes
  (load-file "~/.emacs.machine.el")
#+END_SRC
* End
#+BEGIN_SRC emacs-lisp :tangle yes
  (provide 'config)
#+END_SRC

# Local Variables:
# eval: (setq-local org-refile-targets '(("~/.emacs.d/config.org" :maxlevel . 9)))
# End:
