emacs/.emacs.d/config.el

(defadvice org-capture-finalize
    (after delete-capture-frame activate)
  "Advise capture-finalize to close the frame."
  (if (equal "capture" (frame-parameter nil 'name))
    (delete-frame)))

(defadvice org-capture-destroy
    (after delete-capture-frame activate)
  "Advise capture-destroy to close the frame."
  (if (equal "capture" (frame-parameter nil 'name))
    (delete-frame)))

(use-package noflet
  :commands noflet
  :ensure t)

(defun make-capture-frame ()
  "Create a new frame and run `org-capture'."
  (interactive)
  (make-frame '((name . "capture")))
  (select-frame-by-name "capture")
  (delete-other-windows)
  (noflet ((switch-to-buffer-other-window (buf) (switch-to-buffer buf)))
    (org-capture)))

(use-package stickyfunc-enhance
  :ensure t
  :defer t)

(use-package srefactor
  :ensure t
  :defer t)

(use-package semantic
  :hook (prog-mode . semantic-mode)
  :init
  (progn
    (setq semantic-default-submodes
          '( ;; Perform semantic actions during idle time
            global-semantic-idle-scheduler-mode
            ;; Use a database of parsed tags
            global-semanticdb-minor-mode
            ;; Decorate buffers with additional semantic information
            ;; global-semantic-decoration-mode
            ;; Highlight the name of the function you're currently in
            global-semantic-highlight-func-mode
            ;; show the name of the function at the top in a sticky
            global-semantic-stickyfunc-mode
            ;; Generate a summary of the current tag when idle
            ;; global-semantic-idle-summary-mode

            ;; Show a breadcrumb of location during idle time
            global-semantic-idle-breadcrumbs-mode
            ;; Switch to recently changed tags with `semantic-mrub-switch-tags',
            ;; or `C-x B'
            global-semantic-mru-bookmark-mode))))

(use-package which-func
  :disabled
  :config
  (progn
    (which-function-mode +1)
    (setq which-func-unknown "")))

(use-package epa
  :config
  (progn
    ;; EPA basic config
    (setq epa-file-cache-passphrase-for-symmetric-encryption nil)

    ;; Pinentry config
    (setq epa-pinentry-mode 'loopback)))

(use-package auth-source
  :config
  (setq auth-sources '((:source "~/.emacs.d/.authinfo.gpg"))))

(add-hook
 'after-init-hook
 (lambda ()
   (run-at-time
    "1 min"
    nil
    (lambda () (with-temp-buffer
                 (shell-command "killall gpg-agent" (current-buffer)))))))

(use-package erc-config)
  ;;:hook (after-init . erc-autoconnect-servers))

(use-package elfeed
  :ensure t
  :functions (elfeed-toggle-star)
  :commands (elfeed elfeed-db-load elfeed-search-update--force)
  :bind (([f5] . elfeed-load-db-and-open)
         :map elfeed-search-mode-map
         ("m" . elfeed-toggle-star)
         ("M" . elfeed-toggle-star)
         ("h" . elfeed-hydra/body)
         ("q" . elfeed-save-db-and-bury))
  :init
  ;; Functions to support syncing .elfeed between machines
  ;; makes sure elfeed reads index from disk before launching
  (defun elfeed-load-db-and-open ()
    "Wrapper to load the elfeed db from disk before opening"
    (interactive)
    (elfeed-db-load)
    (elfeed)
    (elfeed-search-update--force))
  :config
  (progn
    ;;write to disk when quiting
    (defun elfeed-save-db-and-bury ()
      "Wrapper to save the elfeed db to disk before burying buffer"
      (interactive)
      (elfeed-db-save)
      (quit-window))

    (defun elfeed--toggle-tag-in-filter (filter tag)
      "Toggles the tag in elfeed search filter."
      (if (s-contains? tag filter)
          (s-replace "  " " " (s-replace tag "" filter))
        (concat filter " " tag)))

    (defun elfeed-filter-toggle-tag (tag)
      "Toggle the tag in active filter."
      (elfeed-search-set-filter (elfeed--toggle-tag-in-filter elfeed-search-filter tag)))

    (setq elfeed-db-directory "~/.elfeed")

    (defhydra elfeed-hydra nil
      "
^Tags^			^Duration^		^Actions^
^^^^^^^---------------------------------------------------------------
_e_macs			_6_: Last 6 months	_U_: Mark as Unread
_c_omics			_T_: Today		_R_: Mark as Read
_m_achine-learning 	_w_: Last week		_b_: Open in browser
_s_cience
_u_nread
"
      ("e" (elfeed-filter-toggle-tag "+emacs"))
      ("u" (elfeed-filter-toggle-tag "+unread"))
      ("c" (elfeed-filter-toggle-tag "+comics"))
      ("m" (elfeed-filter-toggle-tag "+ml"))
      ("s" (elfeed-filter-toggle-tag "+science"))
      ("6" (elfeed-filter-toggle-tag "@6-months-ago"))
      ("T" (elfeed-filter-toggle-tag "@1-day-ago"))
      ("w" (elfeed-filter-toggle-tag "@1-week-ago"))
      ("U" (elfeed-search-tag-all-unread))
      ("R" (elfeed-search-untag-all-unread))
      ("b" elfeed-search-browse-url)
      ("n" next-line)
      ("<down>" next-line)
      ("p" previous-line)
      ("<up>" previous-line)
      ("q" (message "Exit from Elfeed Hydra.") :exit t))

    (defalias 'elfeed-toggle-star
      (elfeed-expose #'elfeed-search-toggle-all 'star))))

(use-package elfeed-org
  :ensure t
  :commands (elfeed-org)
  :init
  (progn
    (setq rmh-elfeed-org-files '("~/.elfeed/feed.org"))
    (add-hook 'after-init-hook #'elfeed-org)))

(use-package elfeed-goodies
  :ensure t
  :hook (after-init . elfeed-goodies/setup))

(use-package challenger-deep-theme
  :ensure t
  :config
  (progn
    (load-theme 'challenger-deep t)
    (set-frame-font "Iosevka-18")))

(use-package spaceline
  :disabled
  :config
  (require 'spaceline-config)
  (spaceline-emacs-theme))

(use-package smart-mode-line
  :disabled
  :config
  (setq sml/no-confirm-load-theme t)
  (sml/setup))

(use-package helium-modeline
  ;; :requires (powerline let-alist projectile flycheck window-numbering)
  :hook (window-setup . powerline-helium-theme))

(use-package theme-enhancement
  :hook (after-init . (lambda () (theme-enhancement/apply nil :italics :org))))

(use-package display-line-numbers
  :hook (after-init . global-display-line-numbers-mode)
  :init
  (setq-default display-line-numbers-widen t
                display-line-numbers-grow-only t
                display-line-numbers-width 5)
  (set-face-attribute 'line-number-current-line nil :inherit 'fringe))

(load-file "~/.emacs.machine.el")

(provide 'config)
